Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja4/magne-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 4 Davvi Girji 2010 .
nob: Artikkel i boka Samisk skolehistorie 4 . Davvi Girji 2010 .

source: Ii oktage ipmirdan ahte ohppen
nob: Ingen forsto at jeg lærte

source: Magne Skåden , 2007 ( Govva : Rigmor Bang , Harstad Tidende )
nob: Magne Skåden , 2007 ( Foto : Rigmor Bang , Harstad Tidende )

source: Magne domantrener Skåden ( 1977 ) lea bajásšaddan ja orru sámi márkogilis Láŋtdievás Skániin , sámi etniin ja dáža áhčiin .
nob: Magne domantrener Skåden ( 1977 ) er vokst opp og bosatt i Planterhaug i Skånland , ei av de samiske markebygdene , med samisk mor og norsk far .

source: Sus lea buozanvuohta mii lea gohčoduvvon garrasit psykalaččat doaimmashehttejuvvomin , ja dán nama vuolde son lea álo eallán , ja dearvvašvuođabálvalusas ain gohčodit su nu .
nob: Han er diagnostisert dypt psykisk utviklingshemmet , en diagnose han har levd under og som fortsatt opprettholdes av helsevesenet .

source: Su lagamusat leat álo diehtán ahte lei ollu su siste , muhto eai diehtán movt dan bohtet diehtit ja ovdánahttit dan .
nob: Hans nærmeste har alltid visst at det bodde mye i ham , men ikke visst hvordan få tak i det og utvikle det .

source: Son lea vázzán Vatnjavári skuvlla , Skániid skuvlla ja Skániid joatkkaskuvlla , iešguđet lágan bohtosiiguin , dan sivas go sus dan áiggis ii lean makkárge beaktilis metoda muitalit earáide maid son ipmirdii ja háliidii .
nob: Han har gått på Boltås skole , Skånland skole og Skånland videregående skole , med blanda resultat , fordi han i den tida ikke hadde noen effektiv metode for å kommunisere til omverdenen hva han forsto og hva han ville .

source: 2004:s oahpásnuvai čálli ja su bearaš The Institutes for achievement of human potential , IAHP , maiddái gohčoduvvon Domaninstituhttan , Philadelphias USA:s . 2004 čavčča álggii Magne Skåden heivehit iežas hárjehallanmetodaide vuoiŋŋašvigát olbmuid várás .
nob: I 2004 ble forfatteren og familien hans kjent med The Institutes for the Achievement of Human Potential i USA , også kalt Domaninstituttet , og Magne Skåden begynte å trene etter instituttets metoder for hjerneskadde .

source: Ovdáneapmi das maŋás lea leamaš erenoamáš stuoris .
nob: Utviklinga deretter har vært rivende .

source: Cuoŋománu 23. b. 2005 dat luovvanii . Dán beaivvi čálii girječálli iežas vuosttaš sáni fasiliterema bokte , mii mearkkaša ahte čállá giehtačállagiin eará olbmo gieđa fiinnamotorihka vehkiin .
nob: 23. april 2005 skrev forfatteren sitt første ord ved fasilitert skriving , dvs. handskrift med finmotorisk støtte av en annens hand .

source: Dan rájis lea son čállán vihtta girjji . 2006:s almmuhuvvui su vuosttaš girji Jeg er fri !
nob: Siden har han fem bokutgivelser bak seg : I 2006 kom debutboka Jeg er fri !

source: 2007:s almmuhuvvui girji På egne ben !
nob: I 2007 kom bøkene På egne ben !

source: Seamma jagi almmuhuvvui Jeg hadde en underlig drøm .
nob: To år med domantrening og Jeg hadde en underlig drøm .

source: 2008:s almmuhuvvui čuovvoleapmi I mine drømmer åpnes hus !
nob: I 2008 kom oppfølgeren I mine drømmer åpnes hus !

source: Su maŋimus girji dássážii , Jeg er ikke en fjellklatrer ( Mun in leat várregizzu ) , lea noveallačoakkáldat .
nob: Hans hittil siste bok , Jeg er ikke en fjellklatrer , er en novellesamling .

source: Son lea maid searvan Nordnorsk Magasinii , guvttiin noveallain , lea čállán smávva čállosa Evenesnytt : ii , čállán guokte artihkkala Š-bláđđái ja searvan Harstad Tidende girjjálašvuođa juovlanummirii .
nob: Han har også skrevet i Nordnorsk Magasin , Evenesnytt , Š og Harstad Tidende .

source: 2006:s son doalai iežas vuosttaš logaldallama Harstad allaskuvllas domanhárjehallama birra , dan rájis lea son doallan ollu logaldallamiid miehtá riikka .
nob: I 2006 holdt han sitt første foredrag på Høgskolen i Harstad om domantrening , siden har han hatt flere foredrag rundt i landet .

source: Girječálli joatká ain domanhárjehallamiin .
nob: Forfatteren trener fortsatt doman .

source: Háliidii leat dego earát
nob: Ville være som de andre

source: Mun lean álo sávvan beassat leat dego earát .
nob: Jeg har alltid ønsket å være som de andre .

source: Mun buohtastahtten iežan eará mánáiguin guovllus , ja dan buohtastahttimis gahččen áibbas olggobeallai .
nob: Jeg sammenlignet meg med andre barn i området – og i den sammenligninga falt jeg helt gjennom .

source: Mánnán doivon ahte mun oktii goas nu šattan dego earát ja nagodan dan maid earát nagodit .
nob: Som barn trodde jeg at en eller annen gang skulle det bli et big bang , og jeg bli som andre og klare det andre klarte .

source: Sii vihke , sihkkelaste , stohke – ja buot ovddemus – sii hupme .
nob: De sprang , syklet , lekte – og fremfor alt pratet .

source: Oktii ferte boahtit mu áigi , jáhkken , ja ovttageardán go ledjen de jáhkken ahte dát dáhpáhuvvá skuvllas .
nob: En gang måtte det bli min tid , trodde jeg , og naivt trodde jeg at dette skulle skje på skolen .

source: Skuvllas han oahpai áššiid , ledjen ipmirdan .
nob: Det var jo på skolen man lærte ting , hadde jeg forstått .

source: Dievva vuordámušaiguin ledjen gárvvis vuolgit vuosttaš skuvlabeaivái .
nob: Så full av forhåpninger var jeg klar for min første skoledag .

source: Várra ledjen dat vuosttašluohkáhas guhte lei eanemus gealdagasas gii álggii giliskuvlii dan jagi .
nob: Antagelig var jeg den mest spente førsteklassingen som begynte på bygdeskolen det året .

source: Muhto ohppen johtilit ahte ii dáppe ge dáhpáhuvvan nu ollu .
nob: Men jeg lærte fort at heller ikke her skjedde det noe særlig .

source: Mun in nagodan goasse dan maid earát nagodedje , ja go jagit vásse , vuollánin ja oidnen ahte in goasse nagot šat joksat earáid .
nob: Jeg klarte aldri det andre klarte , og etter som årene gikk , resignerte jeg og innså at jeg aldri ville klare å nå de andre igjen .

source: Munnje lei ipmirmeahttun man dihte mun ledjen dákkár – ja álgen oaidnit iežan doavkkes Magnen .
nob: For meg var det uforståelig hvorfor det var slik med meg – og jeg begynte å se på meg selv som dumme Magne .

source: Áiggi mielde álgen jáhkkit ahte mu namma , Magne , mearkkaša doavki .
nob: Etter hvert trodde jeg at navnet mitt , Magne , betydde den dumme .

source: Nu garrasit lei dat jáhkku darvánan munnje , ahte go mu eallin nuppástuvai 2005:s go domanhárjehallan álggii , de dovden vuostehágu iežan nammii .
nob: Så fast var den forestillinga at da livet mitt tok en U-sving i 2005 da domantreninga begynte , følte jeg ubehag ved navnet mitt .

source: Mun áigon leat soames eará go Magne dál go domanhárjehallen , ja geahččalin dan juohke ládje gaskkustit lagamusaide .
nob: Jeg ville være noe annet enn Magne nå som jeg domantrente , og jeg prøvde på alle måter å få signalisert dette .

source: Diehttelas in lihkostuvvan dainna ovdal cuoŋománu 2005:s go álgen fasiliteret ja dađistaga čállit domanhárjehallanbarggu birra .
nob: Selvsagt lyktes jeg ikke i det før jeg i april 2005 begynte å fasilitere og etter hvert begynte å skrive om domantrenerarbeidet .

source: Borgemánu 2005:s ožžon iežan blogga , ja doppe vuolláičállen domanhárjehallin .
nob: I august 2005 fikk jeg egen blogg , og jeg signerte med domantrener .

source: Ii nu áigá jearaiga mu váhnemat ahte áiggun go lonuhit iežan ovddanama , dat han lea álkis ášši dán áigge , ja dalle šadden guorahallat akto iežan nama , ja lei go dan-namat olmmoš mun .
nob: For en stund siden spurte foreldrene mine om jeg ville forandre fornavnet mitt , det var jo en enkel sak i dag , og jeg måtte ta en gjennomgang for meg sjøl på navnet mitt og om det var meg .

source: Dalle veardádallen dárkilit , oanehiš áiggi nama Magnus , mii maid lei mu máttar- máttarádjá namma , muhto hilgon dan .
nob: Jeg foretok en del vurderinger , en stund på navnet Magnus , som er navnet på en tippoldefar , men jeg forkastet også det .

source: Mu namman bisui ain Magne , muhto bidjen domanhárjehalli gaskanamman .
nob: Jeg forble Magne med domantrener som mellomnavn .

source: Govvejuvvon mánáidskuvllas 1985 dálvvi .
nob: Bildet er tatt vinteren 1985 på barneskolen .

source: Eadni oaivvildii diagonála-čuoiganhárjehallan livččii dehálaš ja son fuolahii munnje sabehiid guvttiid bessodagaiguin ja soppiid guvttiid giehtafárffuiguin .
nob: Mamma mente diagonalgang-trening var viktig og fikk ordnet meg ski med to sett bindinger og staver med to sett handlykkjer .

source: Muhto dáiguin sabehiiguin lei hui lossat čuoigat , ja skuvllas bidje daid eret .
nob: Men disse skiene ble tunge å manøvrere , så skolen la dem bort .

source: Muhto moai áhčiin geavaheimme daid .
nob: Men pappa og jeg brukte dem.

source: Šadden Fjell skilag klubbameašttirin dáiguin sabehiiguin guokte jagi maŋŋálaga .
nob: To år på rad ble jeg klubbmester i Fjell skilag på disse skiene .

source: Maŋŋil vurkejuvvojedje sabehat ruovttus maid .
nob: Senere ble skiene satt bort heime også .

source: Dál sii leat báhcán boares muitun garáša bielkkaid ala .
nob: Nå er de på hanebjelkene i garasjen og minner om en svunnen tid .

source: ( Govva : Asbjørg Skåden )
nob: ( Foto : Asbjørg Skåden )

source: Muhtin árkiivvaid vurkejin čiekŋalassii muitui
nob: Noen arkiv lukket jeg dypt ned i minnet

source: Sámi skuvlahistorjá – čállit girjái erenoamášoahpahusa birra – lei gažaldat masa golai guhkes áigi vástidit , juo , olles 3 ja bealle jagi .
nob: Samisk skolehistorie – skrive til bindet om spesialundervisning – var et spørsmål det tok tid å svare ja på , faktisk 3 ½ år .

source: Ožžon dán gažaldaga 2005 čavčča , vástidin juo , muhto fas geassádin .
nob: Jeg fikk spørsmålet høsten 2005 , svarte ja , men ombestemte meg .

source: In háliidan rahpat boares arkiivvaid skuvlaáiggis .
nob: Jeg orket ikke åpne arkivene fra skoletida .

source: Muhto beassážiid 2009 , go fas ožžon gažaldaga , de dovden ahte dál sáhtán fas muittašit skuvlaáiggi .
nob: Men i påsken 2009 , da jeg igjen fikk spørsmålet , kjente jeg at jeg nå kunne gå tilbake til skoletida og huske derfra .

source: Mu skuvlavázzima dássi lei badjelis gaskameari mu vuoiŋŋašvigi ektui , go mu váhnemat čuovuiga dárkilit mu skuvlavázzima , lean dál maŋŋil ipmirdan , ja maiddái dál maŋŋil oaidnán ahte skuvlahálddahus Skániin lei hui positiiva mu ovdáneapmái ; guokte faktora maid dan áiggi válden diehttelassan , muhto maid maŋŋil lean fuobmán ahte eai dattege lean nu diehttelas áššit .
nob: Jeg har i ettertid skjønt at jeg nok hadde en skolegang over gjennomsnittet for min hjerneskade , fordi mine foreldre fulgte meg tett , og fordi skoleadministrasjonen i Skånland var uhyre positiv i forhold til min utvikling . De to faktorene tok jeg den gang som en selvfølge , men senere har jeg skjønt at det ikke var det .

source: Ii oktage sis geat barge ja heivehalle munnje skuvlafálaldaga , ipmirdan ahte áidna maid háliidin lei leat dego earát , máhttit dan maid earát ja oahppat dan maid earát .
nob: Ingen kunne vite da de drev og tilrettela mitt tilbud at det eneste jeg ønsket , var å være som de andre , klare det de andre klarte og lære det de andre lærte .

source: Nu nanu miella lei oahppat seamma maid earát ahte go Miki Nagayaki Domaninstituhtas skábmamánu 2005 jearai mus maid mun háliidan lohkat , de vástidin ahte háliidan lohkat dan seamma maid earát lohket , ja nu lohken buot vuođđoskuvlla ja joatkkaskuvlla girjjiid .
nob: Så sterk var trangen til å lære det de andre lærte at da Miki Nagayaki på Domaninstituttet i november 2005 spurte hva jeg ønsket å lese , svarte jeg at jeg ville lese det de andre lærte og leste gjennom grunnskolen og videregående skole .

source: Ja nu šattai .
nob: Og slik ble det .

source: Go bođiimet ruovttoluotta USA:s ja galggaimet hukset munnje dan ođđa prográmma , maiddái lohkanprográmma , de luoikkaheimmet mii vuođđoskuvlla girjjiid , mat gárte oalle ollu , Skániid vuođđoskuvllas , ja joatkkaskuvlagirjjiid luoikkaheimmet Skániid joatkkaskuvllas .
nob: Da vi var tilbake fra USA og skulle bygge opp det nye programmet , inklusive leseprogrammet , lånte vi grunnskolens bøker , et forholdsvis stort antall , av Skånland skole , og videregåendes bøker lånte vi av Skånland videregående skole .

source: Ášši lea nu ahte mii logahalaimet ja ain logahallat buot doaimmaid systemáhtalaččat , ja jus mii geahččat lohkanlisttu maŋos áigodahkii skábmamánu 2005:s miessemánu 2006 rádjái , gávdnat mii vuođđoskuvlla girjjiid doppe .
nob: Vi registrerte og registrerer alle aktiviteter systematisk , og går vi tilbake til leselista for perioden fra november 2005 til mai 2006 finner vi grunnskolens bøker der .

source: Skuvllas lei mu bargovuohki nu ahte galgen geahččalit ovdánahttit iežan fysalaš attáldagaid .
nob: Jeg hadde et skoleopplegg der jeg skulle jobbe med å utvikle fysiske ferdigheter .

source: Dát galggai dáhpáhuvvat ovtta lanjas gos ledjen akto oahpaheddjiin dahje assisteanttain , movt ain heivii .
nob: Dette skulle skje på et rom der jeg var alene med en lærer eller en assistent , alt etter som .

source: Mu árgabeaivi skuvllas lei nu go ovdal namuhuvvon várra veahá eanet losit go gaskamearalaččat dan sivas go mus leat dat váhnemat mat mus leat , ja dan sivas go oahpahusvuogádagas álo leat leamaš positiivvalaš doarjjaolbmot mu lahka , olbmot geat háliidedje dahkat juoidá mu ovdáneapmái .
nob: Min skolehverdag var som jeg sa antagelig litt mer enn gjennomsnittet fordi jeg har de foreldrene jeg har , og fordi det i utdanningssystemet alltid har befunnet seg positive støttespillere for meg , folk som gjerne ville gjøre noe for min utvikling .

source: Lihkká ledjen akto ja olggobealde , álo akto vaikko mus lei assisteanta iežan lahka .
nob: Likevel , jeg var alene og utenfor , alltid alene uansett om jeg hadde en assistent i nærheten .

source: Ledjen akto , ja dovden ahte mus eai lean vuogádagas earát go ieš , geasa sáhtten luohttit .
nob: Jeg var alene og hadde bare meg selv , følte jeg , å stole på i systemet .

source: Maŋŋil lean oaidnán ahte ii lean nu , muhto dalle ledjen akto .
nob: I ettertid i fugleperspektiv ser jeg noe annet , men den gang var jeg alene .

source: Áibbas akto .
nob: Helt alene .

source: Ledjen akto máilmmis gitta álgen fasiliteret ja dan bokte bessen kommuniseret olggos guvlui .
nob: Jeg var alene i livet til jeg begynte å fasilitere og slik kunne kommunisere meg ut .

source: Vuosttažettiin váillui mus oahppanmokta .
nob: Mange ting spilte inn i læringsprosessen .

source: Mu oahppanmokta lei vuollelis go ii veaháge , mokta leat sierra lanjas ja dahkat juoidá mii mu mielas lei joavdelas .
nob: For det første var jeg null motivert , langt under null motivert , til å være på enerom og gjøre noe jeg anså som dilldall .

source: Nuppádassii , oahpahusvuohki ii leat vuođđuduvvon ipmárdusa nala jierpmi doaibmamis , vuoiŋŋašvigi birra ja dan divodeamis .
nob: For det andre bygde ikke opplegget på en forståelse av hjernefunksjoner , hjerneskade og reparasjon av hjerneskade .

source: Lei huksejuvvon , jus lei masage huksejuvvon , heajos ipmárdussii vuoiŋŋašvigiid dovdomearkkaide .
nob: Det bygde , i beste fall om det bygde på noe , på en vag forståelse av et symptom på hjerneskade .

source: Šattai dovdomearkkaid birra bargu , ii ge sivaid vuostá bargojuvvot .
nob: Det ble symptomrettet , ikke årsaksrettet .

source: Goalmmádassii lei mu oahppan huksejuvvon juoga lágan ipmárdussii ahte mun in sáhttán doaimmahit makkárge jierpmálaš oahppama .
nob: For det tredje bygde det på en slags forståelse som sa at jeg ikke kunne foreta noe særlig intelligensmessig læring .

source: Njealjádassii váilo mis gulahallangaskaoamit gaskkal mu ja earáid .
nob: For det fjerde manglet vi totalt kommunikasjonsverktøy mellom meg og de andre .

source: Earát eai ipmirdan mu jienaid , ja eará lágan gulahallangaskaoamit nugo giehtagiella ja piktográmma eai šaddan goasse gulahallangaskaoapmin ieš guđet lágan sivaid geažil .
nob: De andre forstod ikke mine lyder , og noen annen kommunikasjon som tegnspråk og piktogram ble aldri noe kommunikasjonsverktøy av ulike årsaker .

source: Piktográmma lei mu mielas joavdelas .
nob: Piktogram var i min oppfatning tull .

source: Giehtagiella ii doaibman , go eai ipmirdan prinsihpa ahte iežan vuoiŋŋašvigi geažil dárbbašin guhkes áiggi ovdal gieđat jeagadedje mu .
nob: Tegnspråk gikk ikke , fordi man ikke forstod prinsippet om at jeg på grunn av min hjerneskade trengte lang tid før en kommando kom ut til hendene mine .

source: Dasa lassin lei oahpahus dušše muhtumin , ja doaimmai buoremusat maŋŋil juohke háve go mu váhnemat ledje čoahkkinastán skuvllain mu oahppama birra .
nob: I tillegg var opplæringa sporadisk og fungerte best etter hver gang mine foreldre hadde hatt møte med skolen omkring min opplæring .

source: Loahpa loahpas sáhttá dadjat ahte ii lean makkárge gulahallan gaskal mu ja oahpaheddjiid dahje assisteanttaid – ja vel unnit eará skuvlamánáiguin .
nob: Så konklusjonen må bli – det var ingen kommunikasjon mellom meg og mine lærere eller assistenter – langt mindre med mine medelever .

source: Mun ipmirdin sin .
nob: Jeg forstod dem.

source: Sii eai ipmirdan mu ja doivo sihkkarit ahte mus ii lean mihkke gaskkustit maid livččii gánnáhan gullat .
nob: De forstod ikke meg og anså antagelig at jeg ikke hadde noe å formidle som var verd å høre på .

source: Sisa – muhto ii olggos
nob: Inn – men ikke ut

source: Ipmárdus lei ahte mus ii lean mihkke gaskkustit earáide .
nob: Jeg ble ansett å ikke ha noe å formidle i det hele tatt .

source: Soaitá leat dan sivas go mu vuoiŋŋašvihki lea dakkár ahte mun in nagodan darvvihit čalmmiid ovtta sadjái .
nob: Kanskje fordi min hjerneskade arter seg slik at jeg ikke har samsyn .

source: Muhto dát lea buorránan njealji jagi doman-hárjehallamiin .
nob: Vel , det er blitt bedre etter fire år med domantrening .

source: Go váilu dákkár darvvihanoaidnu , de ii nagot bissehit čalmmiid ovtta sadjái .
nob: Ved manglende samsyn fester man ikke øynene .

source: Guoros čalmmit leat eatnasiidda seamma go ahte ii leat mihkke gaskkustit .
nob: Tomme øyne betyr for de fleste at det ikke er noe budskap å formidle .

source: Mus leat autistalaš dovdomearkkat ja ámadadju mii ii čájet dovdduid .
nob: Jeg har autistiske trekk og ansikt som ikke viser følelser .

source: Jus mun čirron dahje boagustin , de ii oaidnán oktage dan , ja dan sivas lei álki jáhkkit ahte mus eai lean dovddut .
nob: Gråt jeg eller lo jeg så ingen det , og det var lett å anta at jeg ikke følte noe .

source: Guoros čalmmit , guoros ámadadju !
nob: Tomme øyne , tomt ansikt !

source: Mus lea heitot motorihkka , sihke fiinna- ja roavvamotorihkka .
nob: Jeg har dårlig motorikk , både fin- og grovmotorikk .

source: Mus ii leat giella , nu dadjet .
nob: Jeg har ikke språk , sies det .

source: Mun dušše huikkán garrasit .
nob: Jeg har bare høge skrik .

source: Go áigon dahje áiggun dadjat maide , de ferten ražastit vai boahtá olggos .
nob: Når jeg skulle eller skal si noe , tar jeg i for å få det ut .

source: Áiggi mielde ohppen ahte dat maid dadjen , bođii olggos dušše čuorvvasin vaikko iežan oaivvis gullen maid dadjen .
nob: Jeg lærte etter hvert at det jeg sa kom ut som høge skrik selv om jeg i mitt hode hørte hva jeg sa .

source: Vástádussan ožžon dábálaččat : Ale čearggo nie , Magne !
nob: Svaret på det jeg sa , pleide bli : Ikke skrik sånn , Magne !

source: Heaitte čeargume , Magne !
nob: Slutt å rope , Magne !

source: Juohkehaš ipmirda ahte dás ii boahtán makkárge gulahallan .
nob: Noen og hver kan tenke seg at det ikke ble noen fruktbar kommunikasjon av dette .

source: Go mus ii lean giella olggos , de jáhkke várra ahte in sáhte maide váldit sisa ge .
nob: Siden jeg ikke hadde språk ut , regnet man vel med at jeg ikke kunne ta noe inn heller .

source: Muhto juste dat gal ii doala deaivása .
nob: Men akkurat det henger ikke på greip .

source: Geaidnu jierbmái manná dan viđa áiccu čađa , ja mun gullen , oidnen , haksen , smáhkejin ja mus ledje dovddut .
nob: Veiene inn til hjernen er de fem sansene , og jeg tok inn via ører , øyne , lukt , smak og følelse .

source: Mus nu go earáin .
nob: Jeg som andre .

source: Muhto go galgen oažžut olggos maidege maid ledjen ožžon sisa ja mii lei láddan mu siste , de gal in lean nu go earát .
nob: Men når det gjaldt å få ut noe av det jeg hadde tatt inn og bearbeidet , da var jeg ikke som andre .

source: Mun in ožžon olggos eará go čuorvasiid , ja earát boastut-áddejedje mu ja sihte orrut jaska .
nob: Jeg fikk det ikke ut på annen måte enn med høge skrik , som ble mistolket og gjerne besvart med å ordre om å tie .

source: Nu ahte mu skuvlavázzin lei giela haga ja mas oahpahusvuogádat ii vuordán maide mus siste maid sáhtáše oažžut olggos gulahallama bokte .
nob: Så jeg gikk gjennom mitt skoleløp uten språk og uten at utdanningssystemet forventet noe særlig innabords som man kunne få ut med kommunikasjon .

source: Mun vázzen skuvlajagiid nu ahte in sáhttán gaskkustit eanet go dan maid nagodin gorutgielain ja go vuostálasten ja ledjen váttis go lei juoga masa in liikon .
nob: Jeg gikk gjennom mine skoleår uten å få formidle meg mer enn det jeg klarte gjennom kroppsspråk og ved å protestere ved å være vrang på det jeg ikke likte .

source: Duođai šattai dát mu buoremus gulahallan muđuige eallimis , ahte leat váttis ja nu dieđihit ahte adden jalgadasa dasa mii galggai dáhpáhuvvat .
nob: Faktisk ble dette etter hvert gjennom livet min sterkeste kommunikasjon generelt , å være vrang og signalisere at jeg gav faen i det som skulle skje .

source: Geahččal dákkár skuvlavázzima , de jáhkán earát ge ledje šaddat váddásat !
nob: Prøv et sånt skoleløp noen og enhver , og jeg tror flere enn jeg ville blitt vrang !

source: Diekkár lea mu vuoiŋŋašvihki .
nob: Slik er min hjerneskade .

source: Eará vuoiŋŋašvigit leat eará ládje .
nob: Andre hjerneskader arter seg ulikt .

source: Muhto mu vuoiŋŋašvihki ii leat nu erenoamáš ahte mun lean áidna Sámis geas dat lea .
nob: Men min hjerneskade er neppe så spesiell at jeg er den eneste i Sápmi med den .

source: Dát mearkkaša ahte leat leamaš ja leat ain mánát ja nuorat geat čohkkájit nu go mun dahken .
nob: Det betyr at det sitter og har sittet barn og unge som jeg har sittet .

source: Mu mielas orru leame dárbbašmeahttun geavahit symptomaid ráhkadit diagnosa ja buoremus lági mielde ráhkadit oahpaheami dáiguin liige minusbeliiguin maid mun vásihin mu skuvlaáiggis .
nob: For meg synes det som unødig bruk av diagnoser på symptomer til en i beste fall symptomrettet opplæring med de ekstra minustegn jeg opplevde i min skoletid .

source: Gávdnojit go Sámis ain mánát geain lea sivva gaskavuoiŋŋamaččain ja geat čohkkájit seamma ládje go mun dahken ?
nob: Sitter det fremdeles midthjerneskadde barn i Sápmi slik jeg satt ?

source: Ii oktage ipmirdan ahte mun ohppen
nob: Ingen forsto at jeg lærte

source: Mánáidskuvllas leat buoremus muittut dalle go bessen leat luohkkálanjas eará mánáiguin ovttas .
nob: Fra barneskolen er de positive minner de gangene jeg var på klasserommet sammen med de andre .

source: Lei doppe gos eanemusat háliidin leat .
nob: Det var der jeg helst ville være .

source: Ovtta jagi ledje mus fásta diimmut luohkkálanjas ja mus lei alccen heivehuvvon beavdi .
nob: Et år hadde jeg faste timer på klasserommet og en egen tilpasset pult .

source: Mun čohkkájin iežan beavdeguoras ja galgen buđaldit iežan bargguiguin das , muhto dan in dahkan .
nob: Jeg satt ved pulten min og skulle pusle med mitt der , noe jeg ikke gjorde .

source: Mun čuvvon baicca dárkilit mielde mii dáhpáhuvai távvala luhtte , ja njammen alccen oahpu dego goike guopparas .
nob: Jeg fulgte intenst med i det som foregikk oppe ved tavla . Jeg sugde til meg som en tørr svamp .

source: Ohppen jođánit ahte in ábut jearrat jus lei juoga maid in ipmirdan , go de šadden guođđit luohkkálanja .
nob: Jeg lærte fort å ikke spørre om det jeg ikke forstod . Da ble jeg nødt til å forlate klasserommet .
